change_log_data = {
    "2.0.4'": [
        "*开发：新增极限法兰尺寸骨架关系式功能"
    ],
    "2.0.2'": [
        "*修复：修复备料清单功能里Q355ND无法对应欧标牌号的问题",
        "*更改：更改备料清单功能里钢材等级改为钢材牌号"
    ],
    "2.0.1'": [
        "*修复：修复备料清单功能不能正确识别法兰行的问题",
    ],
    "2.0.0'": [
        "*开发：增加备料清单功能",
    ],
    "1.2.5": [
        "*开发：优化展板计算功能",
    ],
    "1.2.4": [
        "*开发：螺栓疲劳校核增加mx及兼容单疲劳载荷数据表",
        "*修复：螺栓疲劳校核增加螺栓规格折减系数"
    ],
    "1.2.2": [
        "*开发：螺栓疲劳校核功能"
    ],
    "1.1.0": [
        "*开发：creo附件参数式功能"
    ],
    "1.0.16": [
        "*开发：增加把四个应力曲线txt转换成excel应力曲线的功能"
    ],
    "1.0.15": [
        "*开发：Creo附件参数化功能"
    ],
    "1.0.12": [
        "*开发：提取底标高最大mxy载荷转换成疲劳计算用的载荷功能"
    ],
    "1.0.10": [
        "*开发：塔架底法兰txt应力曲线转excel"
    ],
    "1.0.6": [
        "*开发：bladed批量转换功能"
    ],
    "1.0.5": [
        "*开发：分片塔creo参数关系式与普通塔分开"
        "*修复：creo参数关系式法兰外径的小数点保留问题"
    ],
    "1.0.4": [
        "*开发：读取极限载荷并复制到txt"
    ],
    "1.0.3": [
        "*开发：creo关系式增加分片塔相关"
    ],
    "1.0.1": [
        "*开发：底法兰有限元计算由塔架及基础信息表转换成book.inp文件"
    ],
    "1.0.0": [
        "*开发：增加载荷转换功能"
    ]
}


def print_change_log():
    for item in change_log_data:
        print(item)
        for content in change_log_data[item]:
            print(content, end='\n')


if __name__ == "__main__":
    print_change_log()
